# ─────────────────────────────
# Taps
# ─────────────────────────────
tap "homebrew/bundle"

# ─────────────────────────────
# CLI Tools - Core
# ─────────────────────────────
brew "neovim"
brew "eza"
brew "bat"
brew "lazygit"
brew "starship"
brew "zoxide"
brew "atuin"
brew "fzf"
brew "fd"
brew "jq"
brew "tmux"
brew "gh"
brew "git-delta"
brew "micro"
brew "tree"
brew "yazi"
brew "gitmoji"
brew "direnv"
brew "rtk"

# ─────────────────────────────
# CLI Tools - AI
# ─────────────────────────────
brew "claude-squad"
brew "gemini-cli"

# ─────────────────────────────
# Shell
# ─────────────────────────────
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"

# ─────────────────────────────
# Languages & Version Managers
# ─────────────────────────────
brew "nvm"
brew "pyenv"
brew "go"
brew "ruby"
brew "deno"
brew "yarn"

# ─────────────────────────────
# Build Tools
# ─────────────────────────────
brew "cmake"
brew "make"
brew "ninja"
brew "gcc"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "coreutils"
brew "gnu-sed"
brew "gawk"
brew "nasm"

# ─────────────────────────────
# Cloud & Infra
# ─────────────────────────────
brew "awscli"
brew "kubernetes-cli"
brew "k3d"
brew "act"
brew "mkcert"

# ─────────────────────────────
# Database
# ─────────────────────────────
brew "libpq"
brew "mysql-client@8.0"
brew "redis"
brew "flyway"
brew "duckdb"

# ─────────────────────────────
# Server & Network
# ─────────────────────────────
brew "nginx"
brew "httpd"

# ─────────────────────────────
# Media & Misc
# ─────────────────────────────
brew "imagemagick"
brew "poppler"
brew "stylua"
brew "swiftformat"
brew "swiftlint"
brew "glab"
brew "figlet"
brew "lolcat"
brew "thefuck"
brew "bc"

# ─────────────────────────────
# Casks - Apps
# ─────────────────────────────
cask "ghostty"
cask "raycast"
cask "keka"
cask "vscodium"
cask "warp"
cask "wezterm"
cask "boring-notch"
cask "claude-code"
cask "cmux"
cask "codexbar"
cask "kakuku"
cask "session-manager-plugin"
cask "gitkraken-cli"

# ─────────────────────────────
# Fonts
# ─────────────────────────────
cask "font-d2coding"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans-kr"
cask "font-noto-sans-symbols-2"
